<a href="https://colab.research.google.com/github/kdzioba/pandas/blob/main/SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
url = ('https://raw.github.com/pandas-dev/pandas/master/pandas/tests/io/data/csv/tips.csv')

In [3]:
tips = pd.read_csv(url)
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [4]:
#select total_bill,tip,sex from tips where rownum<6
tips[['total_bill','tip','sex']].head(5)

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       21.01  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female

In [5]:
#assign
tips.assign(tip_rate=tips['tip']/tips['total_bill'])

     total_bill   tip     sex smoker   day    time  size  tip_rate
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059447
1         10.34  1.66    Male     No   Sun  Dinner     3  0.160542
2         21.01  3.50    Male     No   Sun  Dinner     3  0.166587
3         23.68  3.31    Male     No   Sun  Dinner     2  0.139780
4         24.59  3.61  Female     No   Sun  Dinner     4  0.146808
..          ...   ...     ...    ...   ...     ...   ...       ...
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

[244 rows x 8 columns]

In [9]:
#where
#1st 
tips[tips['time']=='Dinner'].head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [10]:
#2nd
is_dinner=tips['time']=='Dinner'

tips[is_dinner].head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [14]:
#and and or
tips[(tips['time']=='Dinner')&(tips['sex']=='Female')].head()

    total_bill   tip     sex smoker  day    time  size
0        16.99  1.01  Female     No  Sun  Dinner     2
4        24.59  3.61  Female     No  Sun  Dinner     4
11       35.26  5.00  Female     No  Sun  Dinner     4
14       14.83  3.02  Female     No  Sun  Dinner     2
16       10.33  1.67  Female     No  Sun  Dinner     3

In [16]:
#group by
tips.groupby('sex')['tip'].mean()

sex
Female    2.833448
Male      3.089618
Name: tip, dtype: float64

In [19]:
tips.groupby('sex')['total_bill'].count()

sex
Female     87
Male      157
Name: total_bill, dtype: int64

In [21]:
#multiple analitical functions
tips.groupby('day').agg({'tip': np.mean, 'day': np.size})

           tip  day
day
Fri   2.734737   19
Sat   2.993103   87
Sun   3.255132   76
Thur  2.771452   62

In [22]:
#multiple columns
tips.groupby(['day','sex','time']).agg({'tip': np.mean, 'day': np.size})

                         tip  day
day  sex    time
Fri  Female Dinner  2.810000    5
            Lunch   2.745000    4
     Male   Dinner  3.032857    7
            Lunch   1.900000    3
Sat  Female Dinner  2.801786   28
     Male   Dinner  3.083898   59
Sun  Female Dinner  3.367222   18
     Male   Dinner  3.220345   58
Thur Female Dinner  3.000000    1
            Lunch   2.561935   31
     Male   Lunch   2.980333   30

# Join

In [25]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],'value': np.random.randn(4)})
df2 = pd.DataFrame({'key': ['B', 'D', 'D', 'E'],'value': np.random.randn(4)})

df2.head()

  key     value
0   B -0.917500
1   D  1.444282
2   D -0.039176
3   E  0.485000

In [29]:
#inner join
df2_index=df2.set_index('key')

pd.merge(df1,df2,on='key',how='inner')

  key   value_x   value_y
0   B -1.370541 -0.917500
1   D -0.678127  1.444282
2   D -0.678127 -0.039176

In [31]:
pd.merge(df1,df2_index,left_on='key',right_index=True)

  key   value_x   value_y
1   B -1.370541 -0.917500
3   D -0.678127  1.444282
3   D -0.678127 -0.039176

In [32]:
#left 
pd.merge(df1,df2,on='key',how='left')

  key   value_x   value_y
0   A  1.677571       NaN
1   B -1.370541 -0.917500
2   C  2.199644       NaN
3   D -0.678127  1.444282
4   D -0.678127 -0.039176

In [33]:
#right
pd.merge(df1,df2,on='key',how='right')

  key   value_x   value_y
0   B -1.370541 -0.917500
1   D -0.678127  1.444282
2   D -0.678127 -0.039176
3   E       NaN  0.485000

In [34]:
#outer
pd.merge(df1,df2,on='key',how='outer')

  key   value_x   value_y
0   A  1.677571       NaN
1   B -1.370541 -0.917500
2   C  2.199644       NaN
3   D -0.678127  1.444282
4   D -0.678127 -0.039176
5   E       NaN  0.485000

#Unions

In [37]:
df1 = pd.DataFrame({'city': ['Chicago', 'San Francisco', 'New York City'],'rank': range(1, 4)})
df2 = pd.DataFrame({'city': ['Chicago', 'Boston', 'Los Angeles'],'rank': [1, 4, 5]})

df2.head()

          city  rank
0      Chicago     1
1       Boston     4
2  Los Angeles     5

In [39]:
#union
pd.concat([df1,df2])

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
0        Chicago     1
1         Boston     4
2    Los Angeles     5

In [40]:
#union all
pd.concat([df1,df2]).drop_duplicates()

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
1         Boston     4
2    Los Angeles     5

# Analitycal Function

In [41]:
#rank RANK() OVER(PARTITION BY sex ORDER BY tip) AS rnk
# SELECT * FROM (
#  SELECT
#    t.*,
#    RANK() OVER(PARTITION BY sex ORDER BY tip) AS rnk
#  FROM tips t
#  WHERE tip < 2
#)
#WHERE rnk < 3
#ORDER BY sex, rnk;

(tips[tips['tip'] < 2].assign(rnk_min=tips.groupby(['sex'])['tip'].rank(method='min')).query('rnk_min < 3').sort_values(['sex', 'rnk_min']))

     total_bill   tip     sex smoker  day    time  size  rnk_min
67         3.07  1.00  Female    Yes  Sat  Dinner     1      1.0
92         5.75  1.00  Female    Yes  Fri  Dinner     2      1.0
111        7.25  1.00  Female     No  Sat  Dinner     1      1.0
236       12.60  1.00    Male    Yes  Sat  Dinner     2      1.0
237       32.83  1.17    Male    Yes  Sat  Dinner     2      2.0